
## Plan Result (terraform/envs/kaz-under-the-bridge)

[CI link](https://github.com/kaz-under-the-bridge/my-cloud-iac-aws/actions/runs/14859018932)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_route53_zone.kaz_under_the_bridge


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_route53_zone.kaz_under_the_bridge will be created
  + resource "aws_route53_zone" "kaz_under_the_bridge" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "aws.under-the-bridge.work"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "Name" = "aws.under-the-bridge.work"
        }
      + tags_all            = {
          + "Environment" = "sandbox"
          + "Name"        = "aws.under-the-bridge.work"
          + "Project"     = "my-cloud-iac-aws"
          + "Terraform"   = "true"
        }
      + zone_id             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":8,"Program":"tfcmt","SHA1":"24ba763d96eeea4c2da008f3a61f2e48e2dfbd47","Target":"terraform/envs/kaz-under-the-bridge","Vars":{},"WorkflowName":"terraform-plan"} -->